{
  "_name_or_path": "output/right_hg38/",
  "architectures": [
    "MethylBertEmbeddedDMR"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": null,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": null,
  "layer_norm_eps": 1e-12,
  "loss": "focal_bce",
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 4,
  "num_labels": 125,
  "num_rnn_layer": 1,
  "output_attentions": true,
  "output_hidden_states": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "rnn": "lstm",
  "rnn_dropout": 0.0,
  "rnn_hidden": 768,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 3,
  "use_cache": true,
  "vocab_size": 69
}
